import React, { Component } from "react";
import Chart from "react-apexcharts";
function App(){

    return (

        <div className='App'>

            <header className='App-header'>
                <Chart
                type='bar'
                width={600}
                hight={600}
                series={[
                    ///данные для таблицы (время и количество материала)
                    {
                        name:'2021-05-04Е09:50:20',
                        data:[23.9, 43.2, 8.8, 17.7]
                    },
                    {
                        name: '2021-05-04T10:30:40',
                        data: [26.2, 42.8, 16.9, 16.3]
                    },
                    {
                        name: '2021-05-04T11:05:52 ',
                        data: [27.2, 43.8, 16.6, 13.8]
                    },
                    {
                        name: '2021-05-04T11:44:28',
                        data: [ 27.3, 43.9, 16.4, 13.6]
                    },
                    {
                        name: '2021-05-04T12:26:10',
                        data: [27.4, 44.3, 16.8, 13.5]
                    },
                    {
                        name: '2021-05-04T13:01:01',
                        data: [26.9, 43.3, 30.9, 14.4]
                    }

                ]}
                options={{
                chart:{
                    stacked: true ///свойство позволяет отображать данные по категориям вертикально
                },
                xaxis:{
                    //категории которые будут подписаны под графиками( в нашем случае материалы)
                   categories:['Агломерат3\n' +
                   'ЗСМК крупный','Агломерат \n' +
                   'ЗСМК мелкий','Агломерат \n' +
                   'складской','Окатыши4\n' +
                   'карельские \n' +
                   'НО']
                }
                }}
                >

                </Chart>
            </header>
        </div>
);
}
export default App;